{
  "ACCOUNT_VERIFIED": "Your account has already been verified",
  "ACCOUNT_INCORRECT_EMAIL_PASSWORD": "Your username or password were incorrect, please supply valid login credentials",
  "ACCOUNT_NOT_VERIFIED": "Your account has not been verified yet, pelase login with a password to verify your phone number",
  "ACCOUNT_EMAIL_EXISTS": "The {0} provided already exists in the system. Please login using your existing email / phone number. Click reset password if you have forgotten your password.",
  "ACCOUNT_INVALID_TOKEN": "Token is incorrect or expired",
  "ACCOUNT_EMAIL_NOT_FOUND": "We could not find the email specified",
  "ACCOUNT_TOKEN_NOT_REGISTERED": "Token is not registered by the application",
  "ACCOUNT_BLOCKED": "Your account has been blocked, pelase contact support",
  "ACCOUNT_INVALID_OLD_PASSWORD": "Your old password is incorrect",
  "ACCOUNT_USER_NOT_FOUND": "User with id '{0}' was not found",
  "ACCOUNT_INVALID_PHONE": "We could not verify your phone, please check the number and try again.",
  "ACCOUNT_NO_AUTHY_ACCOUNT": "We cannot verify your OTP as your account is not registered, please register an account.",
  "ACCOUNT_OTP_INVALID": "Invalid OTP: {0}",
  "ACCOUNT_ALREADY_LOGGED_IN": "User is already logged in, cannot register an account",
  "ACCOUNT_NO_OTP": "Please enter the OPT sent to your phone",
  "ACCOUNT_NO_EMAIL_OR_PHONE": "Please enter a valid email address or phone number so we can identify your account",
  "ACCOUNT_DISPOSIBLE_EMAIL": "The email address {0} has been flagged as disposible, please use a valid email address",
  "ACCOUNT_UNDELIVERABLE_EMAIL": "We are unable to send emails to {0}, please enter a valid email address",
  "CART_ADDRESS_NOT_FOUND": "Could not find the address linked to your cart",
  "CART_NO_ADDRESS": "Billing or shipping address not found, please enter a valid address.",
  "CART_NO_RESERVATIONS": "Cannot find cart items to reserve stock.",
  "CART_ITEMS_NOT_FOUND": "We could not find the products you want to add to your cart, please try again.",
  "CART_EMPTY": "There are no items in your cart to checkout!",
  "CREDITS_INSUFFICIENT_BALANCE": "Sorry, you do not have any credits to use on this order.",
  "CHECKOUT_UNEXPECTED_ERROR": "An error has occured while trying to complete your order, please try again. {0}",
  "CHECKOUT_CART_CHANGED": "Something has changed in your cart, please review your cart and try again.",
  "CHECKOUT_MISSING_PAYMENT_METHOD": "No payment option has been selected, please enter your card details below.",
  "ORDERS_INVALID_TRANSITION": "Cannot transition from {0} to {1}; order item: {2}",
  "ORDERS_INVALID_PAYMENT": "Cannot transition to Payment Taken as there are no cash payments on this order {0}",
  "ROLES_NOT_FOUND": "Role not found",
  "ROLES_CANNOT_EDIT_DEFAULT": "Can not edit default role",
  "ROLES_CANNOT_DELETE_DEFAULT": "Can not delete default role",
  "ROLES_CANNOT_SET_administrator": "Can not set administrator role",
  "ROLES_PERMISSION_DENIED": "You do not have permission to access that resource.",
  "DISCOUNTS_NO_LONGER_ACTIVE": "Sorry the coupon code you entered is no longer available.",
  "DISCOUNT_MIN_CART_TOTAL": "Your cart total does not meet the minuimum cost for that coupon.",
  "DISCOUNT_USED_UP": "Sorry, this code has been used the maximum number of times allowed.",
  "DISCOUNT_USED_UP_USER": "Sorry, you have used this code the maximum number of times allowed.",
  "DISCOUNTS_NO_ITEMS_VALID": "Sorry, no items in your cart are valid for the coupon entered.",
  "DISCOUNTS_INVALID_OPERATOR": "Sorry, there was an error applying the coupon code entered. Invalid operator {0}",
  "DISCOUNTS_COUNTRY_NOT_ALLOWED": "Sorry this coupon is not valid for your country",
  "DISCOUNT_FIRST_ORDER_ONLY": "Sorry this coupon can only be used on your first order",
  "COMMON_PAGE_NOT_FOUND": "We could not find the page you were looking for",
  "COMMON_PARAMS_MISSING": "You must specify the following: {0}",
  "COMMON_NOT_FOUND": "{0} with id '{1}' was not found",
  "COMMON_ERROR": "An unexpected error has occured: {0}",
  "COMMON_MODEL_NOT_FOUND": "Sorry, we could not find that {0}",
  "COMMON_INTERNAL_SERVER_ERROR": "Oops, an unexpected error has occured, we apologise for the inconvenience, please contact customer support if the problem persists.",
  "PRODUCTS_OUT_OF_STOCK": "Sorry, the following products are no longer in stock: {0}",
  "PACKS_BUNDLE_EXISTS": "Sorry, there is already a pack / bundle called {0}.",
  "TESTKITS_NOT_REGISTERED": "Testkit has not been registered, cannot update results",
  "TESTKITS_RESULTS_NOT_READY": "Sorry, your test kit results are not ready yet.",
  "BARCODE_ALREADY_REGISTERED": "The barcode provided has already been registered",
  "INTERNATIONALIZATION_NO_LOCALE": "No localization available for {0}",
  "SECURITY_INVALID_SECRET_KEY": "Invalid secret code",
  "AUDIT_INVALID_EVENT_TYPE": "Audit event must be from Types.AUDIT_EVENTS; One of the following: {0}",
  "ALERT_INVALID_TYPE": "Alert type must be from Types.ALERT_EVENTS; One of the following: {0}",
  "SUBSCRIPTION_NOT_PAUSED": "Cannot resume this subscription as it is not paused.",
  "SUBSCRIPTION_ALREADY_CANCELLED": "Cannot cancel this subscription as it is already cancelled.",
  "SUBSCRIPTION_NOT_ACTIVE": "Cannot pause this subscription as it is not currently active.",
  "STRIPE_EVENT_VALIDATION": "Webhook event validation failed",
  "STRIPE_PAYMENT_INTENT_INVALID_STATE": "Cannot {0} as the payment at Stripe is not in a valid state. {1}",
  "CALENDAR_NO_APPOINTMENTS": "Sorry your chosen time slot is no longer available.",
  "CALENDAR_INVALID_DATE": "Sorry you cannot book an appointment in the past, please select a valid date in the future.",
  "CALENDAR_INVALID_DAY": "Sorry you cannot book an appointment on or before today, please choose a date from tomorrow onwards.",
  "CALENDAR_APPOINTMENT_PAST": "Your appointment is no longer available, please set up a new appointment",
  "CALENDAR_NO_CONSULTATION": "We have detected you do not have a prescription or an appointment set up for the medication in your cart, please set up an appointment to receive a prescription.",
  "INVALID_CONSULTATION_STATUS": "Sorry you cannot launch this consultation as its status is {0}.",
  "INVALID_CONSULTATION_ROOM_STATUS": "Sorry the video conference is not in a valid state to run, state: {0}",
  "DUPLICATE": "DUPLICATE",
  "SURVEY_ALREADY_COMPLETE": "This survey is already complete, please exit the survey and visit your dashboard to see the results.",
  "SURVEY_NOT_FOUND": "Customer has not completed a survey."
}
